app/Controllers/Gerencia/Empresa.php

        // Obtener el número total de filas (sin filtros)
        $builderTotal = $this->db->table('empresa');
        $builderTotal->select('COUNT(*) as total');
        $queryTotal = $builderTotal->get();
---
SELECT COUNT(*) as total
FROM `empresa`

    public function delete($id)
    {
        try {
            // Asegúrate de que el idcliente esté incluido en los datos enviados por POST
            if (!isset($id) && filter_var($id, FILTER_VALIDATE_INT) !== false) {
                throw new \Exception("El ID de la empresa es obligatorio.");
            }

            $this->empresa->update($id, [
                'estado' => 0,
            ]);
---
UPDATE `empresa` SET `estado` = 0, `updated_at` = '2024-03-04 15:43:35'
WHERE `empresa`.`id_empresa` IN ('1')

    public function active($id)
    {
        try {
            // Asegúrate de que el idcliente esté incluido en los datos enviados por POST
            if (!isset($id) && filter_var($id, FILTER_VALIDATE_INT) !== false) {
                throw new \Exception("El ID de la empresa es obligatorio.");
            }

            $this->empresa->update($id, [
                'estado' => 1,
            ]);
---
UPDATE `empresa` SET `estado` = 1, `updated_at` = '2024-03-04 15:43:38'
WHERE `empresa`.`id_empresa` IN ('1')