app/Controllers/Gerencia/TipoComprobante.php

    public function obtenerTipoDocumentos(){
        $data = $this->tipoComprobante->where('estado', 1)->findAll();
---
SELECT *
FROM `tipo_comprobante`
WHERE `estado` = 1