app/Controllers/Inventarios/Categorias.php

         // Obtener el número total de filas (sin filtros)
         $builderTotal = $db->table('categorias');
         $builderTotal->select('COUNT(*) as total');
         $queryTotal = $builderTotal->get();
---
SELECT COUNT(*) as total
FROM `categoria`