app/Controllers/Inventarios/Marcas.php

         // Obtener el número total de filas (sin filtros)
         $builderTotal = $db->table('marcas');
         $builderTotal->select('COUNT(*) as total');
         $queryTotal = $builderTotal->get();
---
SELECT COUNT(*) as total
FROM `marca`