app/Controllers/Inventarios/Productos.php

    public function Index()
    {
        $data = [
            'categorias' => $this->categorias->where('estado', 1)->findAll(),
            'marcas' => $this->marcas->where('estado', 1)->findAll(),
            'unidades' => $this->unidad->where('estado', 1)->findAll(),
            'titulo' => 'Administar nuevos productos',
            'datos' =>  $this->productos->where('estado', 1)->findAll()
        ];
---
SELECT *
FROM `categoria`
WHERE `estado` = 1
SELECT *
FROM `marca`
WHERE `estado` = 1
SELECT *
FROM `producto`
WHERE `estado` = 1