app/Controllers/Inventarios/Unidades.php

         // Obtener el número total de filas (sin filtros)
         $builderTotal = $db->table('unidad_medida');
         $builderTotal->select('COUNT(*) as total');
         $queryTotal = $builderTotal->get();
---
SELECT COUNT(*) as total
FROM `unidad_medida`