app/Controllers/Ventas/Clientes.php

SELECT COUNT(*) as total
FROM `cliente`
---
        // Obtener el número total de filas (sin filtros)
        $builderTotal = $db->table('cliente');
        $builderTotal->select('COUNT(*) as total');
        $queryTotal = $builderTotal->get();