app/Controllers/Ventas/Facturar.php

SELECT *
FROM `ventas`
WHERE `estado` = 1
---
    public function Index($estado = 1)
    {
        $ventas = $this->ventas->where('estado', $estado)->findAll();