app/Controllers/Ventas/TipoDocumento.php

SELECT *
FROM `tipo_documento`
WHERE `estado` = 1
---
    public function Index($estado = 1)
    {
        $tipoDocumento = $this->tipoDocumento->where('estado', $estado)->findAll();

SELECT *
FROM `tipo_documento`
---
    public function obtenerTipoDocumentos(){
        $data = $this->tipoDocumento->findAll();

SELECT *
FROM `tipo_documento`
WHERE `estado` = 1
---
    public function eliminated($estado = 0)
    {
        $tipoDocumento = $this->tipoDocumento->where('estado', $estado)->findAll();

SELECT COUNT(*) as total
FROM `tipo_documento`
---
        // Obtener el número total de filas (sin filtros)
        $builderTotal = $db->table('tipo_documento');
        $builderTotal->select('COUNT(*) as total');
        $queryTotal = $builderTotal->get();