app/Controllers/Ventas/Venta.php

SELECT *
FROM `venta`
WHERE `estado` = 1
---
    public function Index($estado = 1)
    {
        $ventas = $this->ventas->where('estado', $estado)->findAll();